---
kind: method
id: M:Autodesk.Revit.UI.Macros.ApplicationEntryPoint.#ctor
source: html/09d117e2-88dd-a571-7954-50a9d22eef38.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint.#ctor Method

Initializes a new instance of the ApplicationEntryPoint class

## Syntax (C#)
```csharp
public ApplicationEntryPoint()
```